[Killed] BlockStatement
src/components/Grid/Cell.tsx:41:15
 export const areEqual = (
   prevProps: CellProps,
   nextProps: CellProps
-): boolean => {
-  const areEqualCoords =
-    prevProps.coords.filter((coord, idx) => nextProps.coords[idx] !== coord)
-      .length === 0;
-
-  return (
-    prevProps.children === nextProps.children &&
-    areEqualCoords &&
-    prevProps.onClick === nextProps.onClick &&
-    prevProps.onContextMenu === nextProps.onContextMenu
-  );
-};
+): boolean => {};
 
 export const Cell: FC<CellProps> = React.memo(
killedBy: Cell component check Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:43:45
   nextProps: CellProps
 ): boolean => {
   const areEqualCoords =
-    prevProps.coords.filter((coord, idx) => nextProps.coords[idx] !== coord)
+    prevProps.coords.filter((coord, idx) => false)
       .length === 0;
 
killedBy: Cell component check Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/components/Grid/Cell.tsx:43:5
   nextProps: CellProps
 ): boolean => {
   const areEqualCoords =
-    prevProps.coords.filter((coord, idx) => nextProps.coords[idx] !== coord)
-      .length === 0;
+    prevProps.coords.filter((coord, idx) => nextProps.coords[idx] !== coord).length !== 0;
 
   return (
killedBy: Cell component check Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/components/Grid/Cell.tsx:47:5
       .length === 0;
 
   return (
-    prevProps.children === nextProps.children &&
+    prevProps.children !== nextProps.children &&
     areEqualCoords &&
     prevProps.onClick === nextProps.onClick &&
killedBy: Cell component check Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/components/Grid/Cell.tsx:60:72
 
     const onClick = () => rest.onClick(coords);
 
-    const onContextMenu = (event: React.MouseEvent<HTMLDivElement>) => {
-      /**
-       * Prevent context menu by default
-       */
-      event.preventDefault();
-
-      if (isActiveCell(children)) {
-        rest.onContextMenu(coords, flagCounter, bombs);
-      }
-    };
+    const onContextMenu = (event: React.MouseEvent<HTMLDivElement>) => {};
 
     const props = {
killedBy: Cell component check Check prevent default contextMenu for every type of cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:66:11
        */
       event.preventDefault();
 
-      if (isActiveCell(children)) {
+      if (true) {
         rest.onContextMenu(coords, flagCounter, bombs);
       }
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: [1, 1], 0, 10

[Killed] BlockStatement
src/components/Grid/Cell.tsx:66:35
        */
       event.preventDefault();
 
-      if (isActiveCell(children)) {
-        rest.onContextMenu(coords, flagCounter, bombs);
-      }
+      if (isActiveCell(children)) {}
     };
 
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/components/Grid/Cell.tsx:78:22
       onMouseUp,
       onMouseLeave: onMouseUp,
       mouseDown,
-      'data-testid': `${coords}`,
+      'data-testid': ``,
       role: 'cell',
     };
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 1`

- Snapshot  - 1
+ Received  + 1

@@ -38,11 +38,11 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:79:13
       onMouseLeave: onMouseUp,
       mouseDown,
       'data-testid': `${coords}`,
-      role: 'cell',
+      role: "",
     };
 
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 1`

- Snapshot  - 1
+ Received  + 1

@@ -39,10 +39,10 @@

[Killed] ObjectLiteral
src/components/Grid/Cell.tsx:103:30
 }
 
 const ComponentsMap: FC<ComponentsMapProps> = ({ children, ...rest }) => {
-  const nonActiveCellProps = {
-    onContextMenu: rest.onContextMenu,
-    'data-testid': rest['data-testid'],
-    role: rest.role,
-  };
+  const nonActiveCellProps = {};
 
   switch (children) {
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 1`

- Snapshot  - 2
+ Received  + 0

@@ -38,11 +38,9 @@

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:110:5
   };
 
   switch (children) {
-    case CellState.bomb:
-      return (
-        <BombFrame {...nonActiveCellProps}>
-          <Bomb data-testid={`bomb_${rest['data-testid']}`} />
-        </BombFrame>
-      );
+    case CellState.bomb:
     case CellState.hidden:
       return <ClosedFrame {...rest}>{children}</ClosedFrame>;
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 10`

- Snapshot  - 20
+ Received  +  1

@@ -21,39 +21,20 @@

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:118:5
       );
     case CellState.hidden:
       return <ClosedFrame {...rest}>{children}</ClosedFrame>;
-    case CellState.flag:
-      return (
-        <ClosedFrame {...rest}>
-          <Flag data-testid={`flag_${rest['data-testid']}`}>{children}</Flag>
-        </ClosedFrame>
-      );
+    case CellState.flag:
     case CellState.weakFlag:
       return (
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 4
+ Received  + 3

@@ -157,10 +157,11 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:121:43
     case CellState.flag:
       return (
         <ClosedFrame {...rest}>
-          <Flag data-testid={`flag_${rest['data-testid']}`}>{children}</Flag>
+          <Flag data-testid={`flag_${rest[""]}`}>{children}</Flag>
         </ClosedFrame>
       );
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 1
+ Received  + 1

@@ -251,11 +251,11 @@

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:124:5
           <Flag data-testid={`flag_${rest['data-testid']}`}>{children}</Flag>
         </ClosedFrame>
       );
-    case CellState.weakFlag:
-      return (
-        <ClosedFrame {...rest}>
-          <WeakFlag data-testid={`weakFlag_${rest['data-testid']}`} />
-        </ClosedFrame>
-      );
+    case CellState.weakFlag:
     default:
       return <RevealedFrame {...nonActiveCellProps}>{children}</RevealedFrame>;
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 13`

- Snapshot  - 12
+ Received  +  7

@@ -21,33 +21,28 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:139:56
   mouseDown?: boolean;
 }
 
-export const ClosedFrame = styled.div<ClosedFrameProps>`
-  display: flex;
-  align-items: center;
-  justify-content: center;
-  user-select: none;
-  cursor: pointer;
-  width: 1.8vw;
-  height: 1.8vw;
-  color: transparent;
-  background-color: #d1d1d1;
-  border: 0.6vh solid transparent;
-  border-color: ${({ mouseDown = false }) =>
-    mouseDown ? 'transparent' : 'white #9e9e9e #9e9e9e white'};
-  &:hover {
-    filter: brightness(1.1);
-  }
-`;
+export const ClosedFrame = styled.div<ClosedFrameProps>``;
 
 const transparent = 'rgba(0,0,0,0)';
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 31
+ Received  +  0

@@ -144,41 +144,10 @@

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:150:19
   color: transparent;
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
-  border-color: ${({ mouseDown = false }) =>
-    mouseDown ? 'transparent' : 'white #9e9e9e #9e9e9e white'};
+  border-color: ${() => undefined};
   &:hover {
     filter: brightness(1.1);
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 1
+ Received  + 0

@@ -167,11 +167,10 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:151:17
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
   border-color: ${({ mouseDown = false }) =>
-    mouseDown ? 'transparent' : 'white #9e9e9e #9e9e9e white'};
+    mouseDown ? "" : 'white #9e9e9e #9e9e9e white'};
   &:hover {
     filter: brightness(1.1);
killedBy: Cell component check Closed Frame renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Closed Frame renders correct 1`

- Snapshot  - 1
+ Received  + 0

@@ -20,11 +20,10 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:157:21
   }
 `;
 
-const transparent = 'rgba(0,0,0,0)';
+const transparent = "";
 const colors: { [key in CellType]: string } = {
   0: transparent,
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 1`

- Snapshot  - 1
+ Received  + 0

@@ -23,11 +23,10 @@

[Killed] ObjectLiteral
src/components/Grid/Cell.tsx:158:47
 `;
 
 const transparent = 'rgba(0,0,0,0)';
-const colors: { [key in CellType]: string } = {
-  0: transparent,
-  1: '#2a48ec',
-  2: '#2bb13d',
-  3: '#ec6561',
-  4: '#233db7',
-  5: '#a6070f',
-  6: '#e400af',
-  7: '#906a02',
-  8: '#fa0707',
-  9: transparent,
-  10: transparent,
-  11: transparent,
-  12: transparent,
-};
+const colors: { [key in CellType]: string } = {};
 
 const RevealedFrame = styled(ClosedFrame)`
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 2`

- Snapshot  - 1
+ Received  + 1

@@ -23,11 +23,11 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:161:6
 const colors: { [key in CellType]: string } = {
   0: transparent,
   1: '#2a48ec',
-  2: '#2bb13d',
+  2: "",
   3: '#ec6561',
   4: '#233db7',
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 3`

- Snapshot  - 1
+ Received  + 0

@@ -23,11 +23,10 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:194:24
   background-color: #ec433c;
 `;
 
-const Flag = styled.div`
-  width: 0px;
-  height: 0px;
-  color: ${transparent};
-  border-top: 0.5vw solid transparent;
-  border-bottom: 0.5vw solid transparent;
-  border-left: 0.5vw solid #ec433c;
-`;
+const Flag = styled.div``;
 
 const WeakFlag = styled(Flag)`
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 12`

- Snapshot  - 9
+ Received  + 0

@@ -28,19 +28,10 @@
