[Killed] ArrowFunction
src/components/Grid/Grid.tsx:31:36
   onContextMenu: (coords: Coords, flagCounter: number, bombs: number) => void;
 }
 
-export const Grid: FC<GridProps> = ({ children, ...rest }) => (
-  <Wrapper size={children.length} role="grid">
-    {children.map((row, y) =>
-      row.map((cell, x) => (
-        // Stryker disable next-line StringLiteral
-        <Cell key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-          {cell}
-        </Cell>
-      ))
-    )}
-  </Wrapper>
-);
+export const Grid: FC<GridProps> = () => undefined;
 
 interface WrapperProps {
killedBy: Grid renders correctly
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
src/components/Grid/Grid.tsx:33:19
 
 export const Grid: FC<GridProps> = ({ children, ...rest }) => (
   <Wrapper size={children.length} role="grid">
-    {children.map((row, y) =>
-      row.map((cell, x) => (
-        // Stryker disable next-line StringLiteral
-        <Cell key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-          {cell}
-        </Cell>
-      ))
+    {children.map(() => undefined
     )}
   </Wrapper>
killedBy: Grid renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid renders correctly 1`

- Snapshot  - 1334
+ Received  +    1

@@ -6,1344 +6,11 @@

[Killed] ArrowFunction
src/components/Grid/Grid.tsx:34:15
 export const Grid: FC<GridProps> = ({ children, ...rest }) => (
   <Wrapper size={children.length} role="grid">
     {children.map((row, y) =>
-      row.map((cell, x) => (
-        // Stryker disable next-line StringLiteral
-        <Cell key={`${y}_${x}_${cell}`} coords={[y, x]} {...rest}>
-          {cell}
-        </Cell>
-      ))
+      row.map(() => undefined)
     )}
   </Wrapper>
killedBy: Grid renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid renders correctly 1`

- Snapshot  - 1334
+ Received  +    1

@@ -6,1344 +6,11 @@
