[Killed] ArrowFunction
src/components/Scoreboard/Counter.tsx:11:53
   children: string;
 }
 
-export const Counter: FC<CounterProps> = React.memo(({ children }) => (
-  <Frame>{children}</Frame>
-));
+export const Counter: FC<CounterProps> = React.memo(() => undefined);
 
 // Stryker disable next-line StringLiteral
killedBy: Render game field by default
statusReason: Error: Counter(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
