[Killed] ArrowFunction
src/components/Scoreboard/Level.tsx:20:3
 }
 
 export const Level: FC<LevelProps> = React.memo(
-  ({ children, value, onChange }) => (
-    <Select onChange={onChange} value={value}>
-      {children.map((item: string) => (
-        <Option key={item} value={item}>
-          {item}
-        </Option>
-      ))}
-    </Select>
-  )
+  () => undefined
 );
 
killedBy: Render game field by default
statusReason: Error: Level(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
src/components/Scoreboard/Level.tsx:22:21
 export const Level: FC<LevelProps> = React.memo(
   ({ children, value, onChange }) => (
     <Select onChange={onChange} value={value}>
-      {children.map((item: string) => (
-        <Option key={item} value={item}>
-          {item}
-        </Option>
-      ))}
+      {children.map(() => undefined)}
     </Select>
   )
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 45
+ Received  + 12

@@ -92,29 +92,21 @@

[Killed] StringLiteral
src/components/Scoreboard/Level.tsx:34:29
 // Stryker disable next-line StringLiteral
 Level.displayName = 'Level';
 
-const Select = styled.select`
-  margin: 0;
-  height: 100%;
-  border-radius: 0;
-  border: 0.15vw solid;
-  border-color: white #9e9e9e #9e9e9e white;
-  background-color: #d1d1d1;
-`;
+const Select = styled.select``;
 
 const Option = styled.option`
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 9
+ Received  + 0

@@ -82,19 +82,10 @@
