[Killed] BlockStatement
src/components/Scoreboard/Reset.tsx:13:66
   onReset: () => void;
 }
 
-export const Reset: FC<ResetProps> = React.memo(({ onReset }) => {
-  const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
-
-  return (
-    <Button
-      onMouseDown={onMouseDown}
-      onMouseLeave={onMouseUp}
-      onMouseUp={onMouseUp}
-      onClick={onReset}
-    >
-      {mouseDown ? '😯' : '🙂'}
-    </Button>
-  );
-});
+export const Reset: FC<ResetProps> = React.memo(({ onReset }) => {});
 
 // Stryker disable next-line StringLiteral
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Reset(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
src/components/Scoreboard/Reset.tsx:23:27
       onMouseUp={onMouseUp}
       onClick={onReset}
     >
-      {mouseDown ? '😯' : '🙂'}
+      {mouseDown ? '😯' : '""
     </Button>
   );
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 3
+ Received  + 1

@@ -229,13 +229,11 @@

[Killed] StringLiteral
src/components/Scoreboard/Reset.tsx:31:29
 // Stryker disable next-line StringLiteral
 Reset.displayName = 'Reset';
 
-const Button = styled.button`
-  font-size: 1.1vw;
-  height: 100%;
-  cursor: pointer;
-  font-weight: 700;
-  border-width: 0.15vw;
-  border-style: solid;
-  background-color: #d1d1d1;
-  border-color: white #9e9e9e #9e9e9e white;
-`;
+const Button = styled.button``;
 
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 11
+ Received  +  0

@@ -99,21 +99,10 @@
