[Killed] ArrowFunction
src/components/Top/Top.tsx:10:3
 export type TopComponentType = LegendProps & GameNameProps;
 
 export const Top: FC<TopComponentType> = React.memo(
-  ({ children, ...legendProps }) => (
-    <Header>
-      <GameName>{children}</GameName>
-      <Legend {...legendProps} />
-    </Header>
-  ),
+  () => undefined,
   // Stryker disable next-line ArrowFunction,BooleanLiteral
   () => true
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Top(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
