[Killed] BlockStatement
src/components/hooks/useMouseDown.ts:10:6
   boolean,
   SetMouseDownStatus,
   SetMouseUpStatus
-] => {
-  const [mouseDown, setMouseDown] = useState(false);
-
-  const onMouseDown = useCallback(
-    () => setMouseDown(true),
-    // Stryker disable next-line ArrayDeclaration
-    []
-  );
-  const onMouseUp = useCallback(
-    () => setMouseDown(false),
-    // Stryker disable next-line ArrayDeclaration
-    []
-  );
-
-  return [mouseDown, onMouseDown, onMouseUp];
-};
+] => {};
 
killedBy: Render game field by default
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))
