[Killed] ArrowFunction
minesweeper/src/core/Field.ts:28:46
  * @param {Cell} state
  * @returns {Field}
  */
-export const generateFieldWithDefaultState = (
-  size: number,
-  state: Cell = CellState.empty
-): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
+export const generateFieldWithDefaultState = () => undefined;
 
 /**
killedBy: Render game field by default
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
minesweeper/src/core/Field.ts:52:77
  * @param {number} probability
  * @returns {Field}
  */
-export const fieldGenerator = (size: number, probability: number): Field => {
-  if (probability < 0 || probability > 1) {
-    throw new Error('Probability must be between 0 and 1');
-  }
-
-  let unprocessedCells = size * size;
-  let restCellsWithBombs = unprocessedCells * probability;
-
-  const result: Field = generateFieldWithDefaultState(size);
-
-  // Stryker disable next-line EqualityOperator
-  for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
-      // Stryker disable next-line EqualityOperator
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeibours([y, x], result);
-        restCellsWithBombs--;
-      }
-      unprocessedCells--;
-    }
-  }
-  return result;
-};
+export const fieldGenerator = (size: number, probability: number): Field => {};
 
killedBy: Render game field by default
statusReason: TypeError: Cannot read properties of undefined (reading 'keys')

[Killed] BlockStatement
minesweeper/src/core/Field.ts:53:43
  * @returns {Field}
  */
 export const fieldGenerator = (size: number, probability: number): Field => {
-  if (probability < 0 || probability > 1) {
-    throw new Error('Probability must be between 0 and 1');
-  }
+  if (probability < 0 || probability > 1) {}
 
   let unprocessedCells = size * size;
killedBy: Field Generator Simple cases Wrong dencity
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Probability must be between 0 and 1"

Received function did not throw

[Killed] ConditionalExpression
minesweeper/src/core/Field.ts:53:7
  * @returns {Field}
  */
 export const fieldGenerator = (size: number, probability: number): Field => {
-  if (probability < 0 || probability > 1) {
+  if (true) {
     throw new Error('Probability must be between 0 and 1');
   }
killedBy: Field Generator Simple cases Smallest possible field without mine
statusReason: Error: Probability must be between 0 and 1

[Killed] BlockStatement
minesweeper/src/core/Field.ts:63:34
   const result: Field = generateFieldWithDefaultState(size);
 
   // Stryker disable next-line EqualityOperator
-  for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
-      // Stryker disable next-line EqualityOperator
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeibours([y, x], result);
-        restCellsWithBombs--;
-      }
-      unprocessedCells--;
-    }
-  }
+  for (let y = 0; y < size; y++) {}
   return result;
 };
killedBy: useGame test cases Render hook by default
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 10
Received length: 0
Received array:  []

[Killed] EqualityOperator
minesweeper/src/core/Field.ts:64:21
 
   // Stryker disable next-line EqualityOperator
   for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
+    for (let x = 0; x >= size; x++) {
       // Stryker disable next-line EqualityOperator
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
killedBy: useGame test cases Render hook by default
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 10
Received length: 0
Received array:  []

[Killed] BlockStatement
minesweeper/src/core/Field.ts:66:66
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
       // Stryker disable next-line EqualityOperator
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeibours([y, x], result);
-        restCellsWithBombs--;
-      }
+      if (restCellsWithBombs / unprocessedCells > Math.random()) {}
       unprocessedCells--;
     }
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] ArrayDeclaration
minesweeper/src/core/Field.ts:68:27
       // Stryker disable next-line EqualityOperator
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
         result[y][x] = CellState.bomb;
-        incrementNeibours([y, x], result);
+        incrementNeibours([], result);
         restCellsWithBombs--;
       }
killedBy: Field Generator Simple cases 2x2 field with 50% probability
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []
