[Killed] ArrowFunction
src/modules/GameWithHooks/GameWithHooks.tsx:30:5
   const [, bombs] = settings;
 
   const onChangeLevelHandler = useCallback(
-    ({ target: { value: level } }: React.ChangeEvent<HTMLSelectElement>) =>
-      onChangeLevel(level as LevelNames),
+    () => undefined,
     // Stryker disable next-line ArrayDeclaration
     []
killedBy: GameWithHooks test cases Change level works fine
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArithmeticOperator
src/modules/GameWithHooks/GameWithHooks.tsx:44:25
       <GameArea>
         <Scoreboard
           time={String(time)}
-          bombs={String(bombs - flagCounter)}
+          bombs={String(bombs + flagCounter)}
           levels={GameLevels as unknown as string[]}
           defaultLevel={level}
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 1
+ Received  + 1

@@ -236,11 +236,11 @@

[Killed] LogicalOperator
src/modules/GameWithHooks/GameWithHooks.tsx:50:10
           onChangeLevel={onChangeLevelHandler}
           onReset={onReset}
         />
-        {isGameOver && <GameOver onClick={onReset} isWin={isWin} />}
+        {isGameOver || <GameOver onClick={onReset} isWin={isWin} />}
         <Grid
           bombs={bombs}
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  -  85
+ Received  + 115

@@ -111,19 +111,44 @@

[Killed] ConditionalExpression
src/modules/GameWithHooks/GameWithHooks.tsx:50:10
           onChangeLevel={onChangeLevelHandler}
           onReset={onReset}
         />
-        {isGameOver && <GameOver onClick={onReset} isWin={isWin} />}
+        {false}
         <Grid
           bombs={bombs}
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 36
+ Received  +  6

@@ -111,44 +111,19 @@
