[Killed] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:47:35
   );
 
   const [gameField, setGameField] = useState<Field>(
-    fieldGenerator(size, bombs / (size * size))
+    fieldGenerator(size, bombs / (size / size))
   );
 
killedBy: Render game field by default
statusReason: Error: Probability must be between 0 and 1

[Killed] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:47:26
   );
 
   const [gameField, setGameField] = useState<Field>(
-    fieldGenerator(size, bombs / (size * size))
+    fieldGenerator(size, bombs * (size * size))
   );
 
killedBy: Render game field by default
statusReason: Error: Probability must be between 0 and 1

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:64:25
   const [time, resetTime] = useTime(isGameStarted, isGameOver);
 
   const onClick = useCallback(
-    (coords: Coords) => {
-      !isGameStarted && setInProgress();
-      try {
-        const [newPlayerField, isSolved] = openCell(
-          coords,
-          playerField,
-          gameField
-        );
-        if (isSolved) {
-          setGameWin();
-        }
-        setPlayerField([...newPlayerField]);
-      } catch (e) {
-        setPlayerField([...gameField]);
-        setGameLoose();
-      }
-    },
+    (coords: Coords) => {},
     [isGameStarted, isGameOver, isWin, level]
   );
killedBy: useGame test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 18
Received length: 0
Received array:  []

[Killed] LogicalOperator
src/modules/GameWithHooks/useGame.ts:65:7
 
   const onClick = useCallback(
     (coords: Coords) => {
-      !isGameStarted && setInProgress();
+      !isGameStarted || setInProgress();
       try {
         const [newPlayerField, isSolved] = openCell(
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:65:7
 
   const onClick = useCallback(
     (coords: Coords) => {
-      !isGameStarted && setInProgress();
+      true;
       try {
         const [newPlayerField, isSolved] = openCell(
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:66:11
   const onClick = useCallback(
     (coords: Coords) => {
       !isGameStarted && setInProgress();
-      try {
-        const [newPlayerField, isSolved] = openCell(
-          coords,
-          playerField,
-          gameField
-        );
-        if (isSolved) {
-          setGameWin();
-        }
-        setPlayerField([...newPlayerField]);
-      } catch (e) {
+      try {} catch (e) {
         setPlayerField([...gameField]);
         setGameLoose();
killedBy: useGame test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 18
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:72:13
           playerField,
           gameField
         );
-        if (isSolved) {
+        if (true) {
           setGameWin();
         }
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:72:13
           playerField,
           gameField
         );
-        if (isSolved) {
+        if (false) {
           setGameWin();
         }
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:76:19
           setGameWin();
         }
         setPlayerField([...newPlayerField]);
-      } catch (e) {
-        setPlayerField([...gameField]);
-        setGameLoose();
-      }
+      } catch (e) {}
     },
     [isGameStarted, isGameOver, isWin, level]
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] ArrayDeclaration
src/modules/GameWithHooks/useGame.ts:77:24
         }
         setPlayerField([...newPlayerField]);
       } catch (e) {
-        setPlayerField([...gameField]);
+        setPlayerField([]);
         setGameLoose();
       }
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 27
Received length: 0
Received array:  []

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:85:61
   );
 
   const onContextMenu = useCallback(
-    (coords: Coords, flagCounter: number, bombs: number) => {
-      !isGameStarted && setInProgress();
-      const [newPlayerField, isSolved, newFlagCounter] = setFlag(
-        coords,
-        playerField,
-        gameField,
-        flagCounter,
-        bombs
-      );
-      setFlagCounter(newFlagCounter);
-      if (isSolved) {
-        setGameWin();
-      }
-      setPlayerField([...newPlayerField]);
-    },
+    (coords: Coords, flagCounter: number, bombs: number) => {},
     // Stryker disable next-line ArrayDeclaration
     [isGameStarted, isGameOver, isWin, level]
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 16
+ Received  +  2

@@ -150,19 +150,10 @@

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:86:7
 
   const onContextMenu = useCallback(
     (coords: Coords, flagCounter: number, bombs: number) => {
-      !isGameStarted && setInProgress();
+      isGameStarted && setInProgress();
       const [newPlayerField, isSolved, newFlagCounter] = setFlag(
         coords,
killedBy: useGame test cases Scoreboard behavior - timer and bomb counter Timer should start by mark a cell by a flag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:86:7
 
   const onContextMenu = useCallback(
     (coords: Coords, flagCounter: number, bombs: number) => {
-      !isGameStarted && setInProgress();
+      true;
       const [newPlayerField, isSolved, newFlagCounter] = setFlag(
         coords,
killedBy: useGame test cases Scoreboard behavior - timer and bomb counter Timer should start by mark a cell by a flag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:95:11
         bombs
       );
       setFlagCounter(newFlagCounter);
-      if (isSolved) {
+      if (true) {
         setGameWin();
       }
killedBy: useGame test cases Scoreboard behavior - timer and bomb counter Timer should start by mark a cell by a flag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:95:21
         bombs
       );
       setFlagCounter(newFlagCounter);
-      if (isSolved) {
-        setGameWin();
-      }
+      if (isSolved) {}
       setPlayerField([...newPlayerField]);
     },
killedBy: useGame test cases Game over behavior Player win the game when setup flag to the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:105:42
   );
 
   const resetHandler = useCallback(
-    ([size, bombs]: [number, number]) => {
-      const newGameField = fieldGenerator(size, bombs / (size * size));
-      const newPlayerField = generateFieldWithDefaultState(
-        size,
-        CellState.hidden
-      );
-
-      setGameField([...newGameField]);
-      setPlayerField([...newPlayerField]);
-      setFlagCounter(0);
-      setNewGame();
-      resetTime();
-    },
+    ([size, bombs]: [number, number]) => {},
     // Stryker disable next-line ArrayDeclaration
     []
killedBy: useGame test cases Render behaviour onChange game level handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 16
Received length: 9

[Killed] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:106:49
 
   const resetHandler = useCallback(
     ([size, bombs]: [number, number]) => {
-      const newGameField = fieldGenerator(size, bombs / (size * size));
+      const newGameField = fieldGenerator(size, bombs * (size * size));
       const newPlayerField = generateFieldWithDefaultState(
         size,
killedBy: useGame test cases onReset game handler
statusReason: Error: Probability must be between 0 and 1

[Killed] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:106:58
 
   const resetHandler = useCallback(
     ([size, bombs]: [number, number]) => {
-      const newGameField = fieldGenerator(size, bombs / (size * size));
+      const newGameField = fieldGenerator(size, bombs / (size / size));
       const newPlayerField = generateFieldWithDefaultState(
         size,
killedBy: useGame test cases onReset game handler
statusReason: Error: Probability must be between 0 and 1

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:123:28
   );
 
   const onChangeLevel = useCallback(
-    (level: LevelNames) => {
-      const newSettings = setLevel(level);
-      resetHandler(newSettings);
-    },
+    (level: LevelNames) => {},
     // Stryker disable next-line ArrayDeclaration
     []
killedBy: useGame test cases Render behaviour onChange game level handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 16
Received length: 9

[Killed] ArrowFunction
src/modules/GameWithHooks/useGame.ts:132:5
   );
 
   const onReset = useCallback(
-    () => resetHandler([size, bombs]),
+    () => undefined,
     // Stryker disable next-line ArrayDeclaration
     [size, bombs]
killedBy: useGame test cases OnClick with OnChangeGameLevel onReset game handler
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrayDeclaration
src/modules/GameWithHooks/useGame.ts:132:24
   );
 
   const onReset = useCallback(
-    () => resetHandler([size, bombs]),
+    () => resetHandler([]),
     // Stryker disable next-line ArrayDeclaration
     [size, bombs]
killedBy: useGame test cases OnClick with OnChangeGameLevel onReset game handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 81
Received length: 1
Received array:  [10]

[Killed] ArrayDeclaration
src/modules/GameWithHooks/useGame.ts:143:15
     isGameOver,
     isGameStarted,
     isWin,
-    settings: [size, bombs],
+    settings: [],
     playerField,
     gameField,
killedBy: useGame test cases Render behaviour Render hook by default
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Object {
    "isGameOver": false,
    "isWin": false,
