[Killed] ArrowFunction
src/modules/GameWithHooks/useTime.ts:10:5
   const [time, setTime] = useState(0);
 
   const onReset = useCallback(
-    () => setTime(0),
+    () => undefined,
     // Stryker disable next-line ArrayDeclaration
     []
killedBy: useGame test cases Scoreboard behavior - timer and bomb counter Time should reset value when onReset have been called
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] BlockStatement
src/modules/GameWithHooks/useTime.ts:15:19
     []
   );
 
-  useEffect(() => {
-    let interval: NodeJS.Timeout;
-
-    if (isGameStarted) {
-      interval = setInterval(() => {
-        setTime(time + 1);
-      }, 1000);
-
-      if (isGameOver) {
-        clearInterval(interval);
-      }
-    }
-
-    return () => {
-      clearInterval(interval);
-    };
-  }, [isGameOver, isGameStarted, time]);
+  useEffect(() => {}, [isGameOver, isGameStarted, time]);
 
   return [time, onReset];
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useTime.ts:18:24
   useEffect(() => {
     let interval: NodeJS.Timeout;
 
-    if (isGameStarted) {
-      interval = setInterval(() => {
-        setTime(time + 1);
-      }, 1000);
-
-      if (isGameOver) {
-        clearInterval(interval);
-      }
-    }
+    if (isGameStarted) {}
 
     return () => {
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/modules/GameWithHooks/useTime.ts:18:9
   useEffect(() => {
     let interval: NodeJS.Timeout;
 
-    if (isGameStarted) {
+    if (false) {
       interval = setInterval(() => {
         setTime(time + 1);
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useTime.ts:19:36
     let interval: NodeJS.Timeout;
 
     if (isGameStarted) {
-      interval = setInterval(() => {
-        setTime(time + 1);
-      }, 1000);
+      interval = setInterval(() => {}, 1000);
 
       if (isGameOver) {
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
src/modules/GameWithHooks/useTime.ts:20:17
 
     if (isGameStarted) {
       interval = setInterval(() => {
-        setTime(time + 1);
+        setTime(time - 1);
       }, 1000);
 
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -5

[Killed] BlockStatement
src/modules/GameWithHooks/useTime.ts:23:23
         setTime(time + 1);
       }, 1000);
 
-      if (isGameOver) {
-        clearInterval(interval);
-      }
+      if (isGameOver) {}
     }
 
killedBy: useTime test cases Timer stops when game is over
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] ConditionalExpression
src/modules/GameWithHooks/useTime.ts:23:11
         setTime(time + 1);
       }, 1000);
 
-      if (isGameOver) {
+      if (false) {
         clearInterval(interval);
       }
killedBy: useTime test cases Timer stops when game is over
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] BlockStatement
src/modules/GameWithHooks/useTime.ts:28:18
       }
     }
 
-    return () => {
-      clearInterval(interval);
-    };
+    return () => {};
   }, [isGameOver, isGameStarted, time]);
 
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 6

[Killed] ArrayDeclaration
src/modules/GameWithHooks/useTime.ts:31:6
     return () => {
       clearInterval(interval);
     };
-  }, [isGameOver, isGameStarted, time]);
+  }, []);
 
   return [time, onReset];
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0
