[Killed] ArrowFunction
src/components/Game/GameArea.tsx:4:29
 import React, { FC } from 'react';
 import styled from '@emotion/styled';
 
-export const GameArea: FC = ({ children }) => <Frame>{children}</Frame>;
+export const GameArea: FC = () => undefined;
 
 const Frame = styled.div`
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
src/components/Game/GameArea.tsx:6:25
 
 export const GameArea: FC = ({ children }) => <Frame>{children}</Frame>;
 
-const Frame = styled.div`
-  display: flex;
-  align-items: center;
-  justify-content: center;
-  flex-direction: column;
-  border: 6px solid #e3e3e3;
-  background-color: #e3e3e3;
-`;
+const Frame = styled.div``;
 
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 20
+ Received  +  0

@@ -40,30 +40,10 @@
