[Killed] ArrowFunction
src/components/Game/Wrapper.tsx:4:28
 import React, { FC } from 'react';
 import styled from '@emotion/styled';
 
-export const Wrapper: FC = ({ children }) => <Frame>{children}</Frame>;
+export const Wrapper: FC = () => undefined;
 
 const Frame = styled.div`
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
