[Killed] ArrowFunction
src/components/Game/GameOver.tsx:11:44
   onClick: () => void;
 }
 
-export const GameOver: FC<GameOverProps> = ({ onClick, isWin }) => (
-  <Frame onClick={onClick} isWin={isWin}>
-    {isWin ? '😎' : '🙁'}
-  </Frame>
-);
+export const GameOver: FC<GameOverProps> = () => undefined;
 
 interface FrameProps {
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
src/components/Game/GameOver.tsx:13:14
 
 export const GameOver: FC<GameOverProps> = ({ onClick, isWin }) => (
   <Frame onClick={onClick} isWin={isWin}>
-    {isWin ? '😎' : '🙁'}
+    {isWin ? "": '🙁'}
   </Frame>
 );
killedBy: Game Over test cases GameOver render win correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😎. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="css-1p4hvro"
    />

[Killed] StringLiteral
src/components/Game/GameOver.tsx:13:21
 
 export const GameOver: FC<GameOverProps> = ({ onClick, isWin }) => (
   <Frame onClick={onClick} isWin={isWin}>
-    {isWin ? '😎' : '🙁'}
+    {isWin ? '😎' : '""
   </Frame>
 );
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 3
+ Received  + 1

@@ -257,13 +257,11 @@
