[Killed] ArrowFunction
src/components/Scoreboard/Scoreboard.tsx:35:48
   bombs: string;
 }
 
-export const Scoreboard: FC<ScoreboardProps> = ({
-  time,
-  levels,
-  defaultLevel,
-  bombs,
-  onReset,
-  onChangeLevel: onChange,
-}) => (
-  <Wrapper>
-    <Counter>{time}</Counter>
-    <div>
-      <Level onChange={onChange} value={defaultLevel}>
-        {levels}
-      </Level>
-      <Reset onReset={onReset} />
-    </div>
-    <Counter>{bombs}</Counter>
-  </Wrapper>
-);
+export const Scoreboard: FC<ScoreboardProps> = () => undefined;
 
 const Wrapper = styled.div`
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
src/components/Scoreboard/Scoreboard.tsx:55:27
   </Wrapper>
 );
 
-const Wrapper = styled.div`
-  display: flex;
-  width: 100%;
-  justify-content: space-between;
-`;
+const Wrapper = styled.div``;
 
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `GameWithHooks test cases Render game field by default 1`

- Snapshot  - 11
+ Received  +  0

@@ -60,21 +60,10 @@
