[Killed] ArrowFunction
src/components/Top/Legend.tsx:19:40
   secondAction?: string;
 }
 
-export const Legend: FC<LegendProps> = ({
-  feature,
-  firstAction,
-  secondAction,
-}) => (
-  <Parent>
-    <strong>{feature}: </strong>
-    <FlagComboParent>
-      <FirstAction>{firstAction}</FirstAction>
-      {secondAction && <SecondAction> + {secondAction}</SecondAction>}
-    </FlagComboParent>
-  </Parent>
-);
+export const Legend: FC<LegendProps> = () => undefined;
 
 const FlagComboParent = styled.code`
killedBy: Render game field by default
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
src/components/Top/Legend.tsx:28:8
     <strong>{feature}: </strong>
     <FlagComboParent>
       <FirstAction>{firstAction}</FirstAction>
-      {secondAction && <SecondAction> + {secondAction}</SecondAction>}
+      {false}
     </FlagComboParent>
   </Parent>
killedBy: Top renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Top renders correctly 1`

- Snapshot  - 9
+ Received  + 0

@@ -21,14 +21,10 @@

[Killed] ConditionalExpression
src/components/Top/Legend.tsx:28:8
     <strong>{feature}: </strong>
     <FlagComboParent>
       <FirstAction>{firstAction}</FirstAction>
-      {secondAction && <SecondAction> + {secondAction}</SecondAction>}
+      {true}
     </FlagComboParent>
   </Parent>
killedBy: Top renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Top renders correctly 1`

- Snapshot  - 9
+ Received  + 0

@@ -21,14 +21,10 @@
