[Killed] ArrowFunction
minesweeper/src/core/CellsManipulator.ts:8:34
  * @param {Coords} coords
  * @returns {Record<string, [number, number]>}
  */
-export const getNeigboursItems = ([y, x]: Coords): Record<
-  string,
-  [number, number]
-> => ({
-  top: [y - 1, x],
-  topRight: [y - 1, x + 1],
-  right: [y, x + 1],
-  rightBottom: [y + 1, x + 1],
-  bottom: [y + 1, x],
-  bottomLeft: [y + 1, x - 1],
-  left: [y, x - 1],
-  leftTop: [y - 1, x - 1],
-});
+export const getNeigboursItems = () => undefined;
 
 /**
killedBy: Render game field by default
statusReason: TypeError: Cannot convert undefined or null to object

[Killed] BlockStatement
minesweeper/src/core/CellsManipulator.ts:37:75
  * @param {Field} field
  * @returns {Cell}
  */
-export const incrementNeibours = (coords: Coords, field: Field): Field => {
-  const items = getNeigboursItems(coords);
-
-  for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
-      const cell = field[y][x];
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
-  }
-
-  return field;
-};
+export const incrementNeibours = (coords: Coords, field: Field): Field => {};
 
killedBy: Check Increment Neibours Simple cases Field with only one item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[9]]
Received: undefined

[Killed] ConditionalExpression
minesweeper/src/core/CellsManipulator.ts:41:9
   const items = getNeigboursItems(coords);
 
   for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
+    if (false) {
       const cell = field[y][x];
       if (cell < 8) {
killedBy: Check Increment Neibours Simple cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,
