[Killed] BooleanLiteral
minesweeper/src/core/detectSolvedPullze.ts:18:32
   let bombsCounter = 0;
   let flagCounter = 0;
   let detectedBombsCounter = 0;
-  let isFieldHaveHiddenCells = false;
+  let isFieldHaveHiddenCells = true;
 
   for (const y of gameField.keys()) {
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
minesweeper/src/core/detectSolvedPullze.ts:20:37
   let detectedBombsCounter = 0;
   let isFieldHaveHiddenCells = false;
 
-  for (const y of gameField.keys()) {
-    for (const x of gameField[y].keys()) {
-      const gameCell = gameField[y][x];
-      const playerCell = playerField[y][x];
-      const isPlayerCellFlag = [flag, weakFlag].includes(playerCell);
-
-      if (playerCell === hidden) {
-        isFieldHaveHiddenCells = true;
-      }
-
-      if (isPlayerCellFlag) {
-        flagCounter++;
-      }
-
-      if (gameCell === bomb) {
-        bombsCounter++;
-
-        if (isPlayerCellFlag) {
-          detectedBombsCounter++;
-        }
-      }
-    }
-  }
+  for (const y of gameField.keys()) {}
 
   const isPuzzleSolved =
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
minesweeper/src/core/detectSolvedPullze.ts:21:42
   let isFieldHaveHiddenCells = false;
 
   for (const y of gameField.keys()) {
-    for (const x of gameField[y].keys()) {
-      const gameCell = gameField[y][x];
-      const playerCell = playerField[y][x];
-      const isPlayerCellFlag = [flag, weakFlag].includes(playerCell);
-
-      if (playerCell === hidden) {
-        isFieldHaveHiddenCells = true;
-      }
-
-      if (isPlayerCellFlag) {
-        flagCounter++;
-      }
-
-      if (gameCell === bomb) {
-        bombsCounter++;
-
-        if (isPlayerCellFlag) {
-          detectedBombsCounter++;
-        }
-      }
-    }
+    for (const x of gameField[y].keys()) {}
   }
 
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArrayDeclaration
minesweeper/src/core/detectSolvedPullze.ts:24:32
     for (const x of gameField[y].keys()) {
       const gameCell = gameField[y][x];
       const playerCell = playerField[y][x];
-      const isPlayerCellFlag = [flag, weakFlag].includes(playerCell);
+      const isPlayerCellFlag = [].includes(playerCell);
 
       if (playerCell === hidden) {
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
minesweeper/src/core/detectSolvedPullze.ts:26:34
       const playerCell = playerField[y][x];
       const isPlayerCellFlag = [flag, weakFlag].includes(playerCell);
 
-      if (playerCell === hidden) {
-        isFieldHaveHiddenCells = true;
-      }
+      if (playerCell === hidden) {}
 
       if (isPlayerCellFlag) {
killedBy: Detect solved puzzle function test cases 5*5 with hidden cells
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
minesweeper/src/core/detectSolvedPullze.ts:26:11
       const playerCell = playerField[y][x];
       const isPlayerCellFlag = [flag, weakFlag].includes(playerCell);
 
-      if (playerCell === hidden) {
+      if (false) {
         isFieldHaveHiddenCells = true;
       }
killedBy: Detect solved puzzle function test cases 5*5 with hidden cells
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BooleanLiteral
minesweeper/src/core/detectSolvedPullze.ts:27:34
       const isPlayerCellFlag = [flag, weakFlag].includes(playerCell);
 
       if (playerCell === hidden) {
-        isFieldHaveHiddenCells = true;
+        isFieldHaveHiddenCells = false;
       }
 
killedBy: Detect solved puzzle function test cases 5*5 with hidden cells
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
minesweeper/src/core/detectSolvedPullze.ts:30:29
         isFieldHaveHiddenCells = true;
       }
 
-      if (isPlayerCellFlag) {
-        flagCounter++;
-      }
+      if (isPlayerCellFlag) {}
 
       if (gameCell === bomb) {
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 1
+ Received  + 1

@@ -236,11 +236,11 @@

[Killed] ConditionalExpression
minesweeper/src/core/detectSolvedPullze.ts:30:11
         isFieldHaveHiddenCells = true;
       }
 
-      if (isPlayerCellFlag) {
+      if (true) {
         flagCounter++;
       }
killedBy: Open cell action Detect win state 5*5 solved case
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: true
Received: false

[Killed] UpdateOperator
minesweeper/src/core/detectSolvedPullze.ts:31:9
       }
 
       if (isPlayerCellFlag) {
-        flagCounter++;
+        flagCounter--;
       }
 
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
minesweeper/src/core/detectSolvedPullze.ts:34:11
         flagCounter++;
       }
 
-      if (gameCell === bomb) {
+      if (true) {
         bombsCounter++;
 
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
minesweeper/src/core/detectSolvedPullze.ts:34:11
         flagCounter++;
       }
 
-      if (gameCell === bomb) {
+      if (gameCell !== bomb) {
         bombsCounter++;
 
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] UpdateOperator
minesweeper/src/core/detectSolvedPullze.ts:35:9
       }
 
       if (gameCell === bomb) {
-        bombsCounter++;
+        bombsCounter--;
 
         if (isPlayerCellFlag) {
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
minesweeper/src/core/detectSolvedPullze.ts:37:13
       if (gameCell === bomb) {
         bombsCounter++;
 
-        if (isPlayerCellFlag) {
+        if (false) {
           detectedBombsCounter++;
         }
killedBy: Detect solved puzzle function test cases Simplest 3*3 case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] UpdateOperator
minesweeper/src/core/detectSolvedPullze.ts:38:11
         bombsCounter++;
 
         if (isPlayerCellFlag) {
-          detectedBombsCounter++;
+          detectedBombsCounter--;
         }
       }
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
minesweeper/src/core/detectSolvedPullze.ts:45:5
   }
 
   const isPuzzleSolved =
-    bombsCounter === detectedBombsCounter &&
-    flagCounter === bombsCounter &&
-    !isFieldHaveHiddenCells;
+    bombsCounter === detectedBombsCounter && flagCounter === bombsCounter || !isFieldHaveHiddenCells;
 
   return [isPuzzleSolved, flagCounter];
killedBy: Detect solved puzzle function test cases Wrong 3*3 without hidden cells case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
minesweeper/src/core/detectSolvedPullze.ts:45:5
   }
 
   const isPuzzleSolved =
-    bombsCounter === detectedBombsCounter &&
-    flagCounter === bombsCounter &&
-    !isFieldHaveHiddenCells;
+    false;
 
   return [isPuzzleSolved, flagCounter];
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
minesweeper/src/core/detectSolvedPullze.ts:46:5
 
   const isPuzzleSolved =
     bombsCounter === detectedBombsCounter &&
-    flagCounter === bombsCounter &&
+    true &&
     !isFieldHaveHiddenCells;
 
killedBy: Detect solved puzzle function test cases Wrong 3*3 without hidden cells case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
minesweeper/src/core/detectSolvedPullze.ts:46:5
 
   const isPuzzleSolved =
     bombsCounter === detectedBombsCounter &&
-    flagCounter === bombsCounter &&
+    flagCounter !== bombsCounter &&
     !isFieldHaveHiddenCells;
 
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
minesweeper/src/core/detectSolvedPullze.ts:47:5
   const isPuzzleSolved =
     bombsCounter === detectedBombsCounter &&
     flagCounter === bombsCounter &&
-    !isFieldHaveHiddenCells;
+    isFieldHaveHiddenCells;
 
   return [isPuzzleSolved, flagCounter];
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
