[Killed] BlockStatement
minesweeper/src/core/openCell.ts:23:26
   const gameCell = gameField[y][x];
   const playerCell = playerField[y][x];
 
-  if (gameCell === bomb) {
-    throw new Error('Game Over');
-  }
+  if (gameCell === bomb) {}
 
   if (flag === playerCell) {
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] StringLiteral
minesweeper/src/core/openCell.ts:24:21
   const playerCell = playerField[y][x];
 
   if (gameCell === bomb) {
-    throw new Error('Game Over');
+    throw new Error("");
   }
 
killedBy: Open cell action Simple cases with loose Open cell with the bomb
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Game Over"
Received message:   ""

      94 |       } else {
      95 |         stryCov_9fa48("253");
    > 96 |         throw new Error(stryMutAct_9fa48("254") ? "" : (stryCov_9fa48("254"), 'Game Over'));

[Killed] ConditionalExpression
minesweeper/src/core/openCell.ts:27:7
     throw new Error('Game Over');
   }
 
-  if (flag === playerCell) {
+  if (false) {
     return [playerField, false];
   }
killedBy: Open cell action Simple cases with loose Open cell with the flag it shouldn't open
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -4,11 +4,11 @@
      10,
      10,

[Killed] ConditionalExpression
minesweeper/src/core/openCell.ts:27:7
     throw new Error('Game Over');
   }
 
-  if (flag === playerCell) {
+  if (true) {
     return [playerField, false];
   }
killedBy: useGame test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 18
Received length: 0
Received array:  []

[Killed] BooleanLiteral
minesweeper/src/core/openCell.ts:28:26
   }
 
   if (flag === playerCell) {
-    return [playerField, false];
+    return [playerField, true];
   }
 
killedBy: Open cell action Simple cases with loose Open cell with the flag it shouldn't open
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrayDeclaration
minesweeper/src/core/openCell.ts:28:12
   }
 
   if (flag === playerCell) {
-    return [playerField, false];
+    return [];
   }
 
killedBy: Open cell action Simple cases with loose Open cell with the flag it shouldn't open
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
minesweeper/src/core/openCell.ts:33:7
 
   playerField[y][x] = gameCell;
 
-  if (gameCell === empty && [hidden, weakFlag].includes(playerCell)) {
+  if (false) {
     const items = getNeigboursItems(coords);
 
killedBy: useGame test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 18
Received length: 1
Received array:  [0]

[Killed] ConditionalExpression
minesweeper/src/core/openCell.ts:33:7
 
   playerField[y][x] = gameCell;
 
-  if (gameCell === empty && [hidden, weakFlag].includes(playerCell)) {
+  if (true) {
     const items = getNeigboursItems(coords);
 
killedBy: useGame test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 18
Received length: 27
Received array:  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

[Killed] BlockStatement
minesweeper/src/core/openCell.ts:36:48
   if (gameCell === empty && [hidden, weakFlag].includes(playerCell)) {
     const items = getNeigboursItems(coords);
 
-    for (const [y, x] of Object.values(items)) {
-      if (checkItemInField([y, x], gameField)) {
-        [playerField] = openCell([y, x], playerField, gameField);
-      }
-    }
+    for (const [y, x] of Object.values(items)) {}
   }
 
killedBy: useGame test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 18
Received length: 1
Received array:  [0]

[Killed] ConditionalExpression
minesweeper/src/core/openCell.ts:37:11
     const items = getNeigboursItems(coords);
 
     for (const [y, x] of Object.values(items)) {
-      if (checkItemInField([y, x], gameField)) {
+      if (false) {
         [playerField] = openCell([y, x], playerField, gameField);
       }
killedBy: Open cell action Open empty cell Open empty cell, simple 3*3 case
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
    Array [
      10,

[Killed] ConditionalExpression
minesweeper/src/core/openCell.ts:37:11
     const items = getNeigboursItems(coords);
 
     for (const [y, x] of Object.values(items)) {
-      if (checkItemInField([y, x], gameField)) {
+      if (true) {
         [playerField] = openCell([y, x], playerField, gameField);
       }
killedBy: Open cell action Open empty cell Open empty cell, simple 3*3 case
statusReason: TypeError: Cannot read properties of undefined (reading '2')

[Killed] ArrayDeclaration
minesweeper/src/core/openCell.ts:38:34
 
     for (const [y, x] of Object.values(items)) {
       if (checkItemInField([y, x], gameField)) {
-        [playerField] = openCell([y, x], playerField, gameField);
+        [playerField] = openCell([], playerField, gameField);
       }
     }
killedBy: useGame test cases Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 18
Received length: 27
Received array:  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
