[Killed] BlockStatement
minesweeper/src/core/setFlag.ts:19:32
   gameField: Field,
   prevFlagCounter: number,
   bombs: number
-): [Field, boolean, number] => {
-  const [y, x] = coords;
-  const cell = playerField[y][x];
-
-  const { flag, weakFlag, hidden } = CellState;
-
-  switch (cell) {
-    case flag:
-      playerField[y][x] = weakFlag;
-      break;
-    case weakFlag:
-      playerField[y][x] = hidden;
-      break;
-    case hidden:
-      if (prevFlagCounter < bombs) {
-        playerField[y][x] = flag;
-      }
-      break;
-  }
-
-  const [isSolved, flagCounter] = detectSolvedPuzzle(playerField, gameField);
-
-  return [playerField, isSolved, flagCounter];
-};
+): [Field, boolean, number] => {};
 
killedBy: useGame test cases Open cell test cases Context menu handler
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
minesweeper/src/core/setFlag.ts:26:5
   const { flag, weakFlag, hidden } = CellState;
 
   switch (cell) {
-    case flag:
-      playerField[y][x] = weakFlag;
-      break;
+    case flag:
     case weakFlag:
       playerField[y][x] = hidden;
killedBy: Set flag action Set flag to the cell check Set Flag action, simple 3*3 case
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    Array [

[Killed] ConditionalExpression
minesweeper/src/core/setFlag.ts:29:5
     case flag:
       playerField[y][x] = weakFlag;
       break;
-    case weakFlag:
-      playerField[y][x] = hidden;
-      break;
+    case weakFlag:
     case hidden:
       if (prevFlagCounter < bombs) {
killedBy: Set flag action Set flag to the cell check Set Flag action, simple 3*3 case
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    Array [

[Killed] ConditionalExpression
minesweeper/src/core/setFlag.ts:32:5
     case weakFlag:
       playerField[y][x] = hidden;
       break;
-    case hidden:
-      if (prevFlagCounter < bombs) {
-        playerField[y][x] = flag;
-      }
-      break;
+    case hidden:
   }
 
killedBy: Render game field by default
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Render game field by default 1`

- Snapshot  - 16
+ Received  +  2

@@ -150,19 +150,10 @@

[Killed] EqualityOperator
minesweeper/src/core/setFlag.ts:33:11
       playerField[y][x] = hidden;
       break;
     case hidden:
-      if (prevFlagCounter < bombs) {
+      if (prevFlagCounter <= bombs) {
         playerField[y][x] = flag;
       }
killedBy: useGame test cases Scoreboard behavior - timer and bomb counter flagCounter counter should stop when flagCounter > bombs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 11

[Killed] ConditionalExpression
minesweeper/src/core/setFlag.ts:33:11
       playerField[y][x] = hidden;
       break;
     case hidden:
-      if (prevFlagCounter < bombs) {
+      if (true) {
         playerField[y][x] = flag;
       }
killedBy: useGame test cases Scoreboard behavior - timer and bomb counter flagCounter counter should stop when flagCounter > bombs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 12
