[Killed] ArrayDeclaration
minesweeper/src/modules/GameSettings.ts:13:13
 export type Settings = [number, number];
 
 export const GameSettings: Record<LevelNames, Settings> = {
-  beginner: [9, 10],
+  beginner: [],
   intermediate: [16, 44],
   expert: [22, 99],
killedBy: useGame test cases Render behaviour Render hook by default
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 4

  Object {
    "isGameOver": false,
    "isWin": false,
