[Killed] BlockStatement
src/modules/GameWithHooks/useSettings.ts:13:18
 
 export const useSettings = (
   defaultLevel = 'beginner' as LevelNames
-): ReturnType => {
-  const [level, setLevel] = useState<LevelNames>(defaultLevel);
-  const [size, bombs] = GameSettings[level];
-
-  return {
-    settings: [size, bombs],
-    level,
-    setLevel: (level) => {
-      setLevel(level);
-      return GameSettings[level];
-    },
-  };
-};
+): ReturnType => {};
 
killedBy: useGame test cases Render behaviour Render hook by default
statusReason: TypeError: Cannot read properties of undefined (reading 'settings')

[Killed] BlockStatement
src/modules/GameWithHooks/useSettings.ts:20:26
   return {
     settings: [size, bombs],
     level,
-    setLevel: (level) => {
-      setLevel(level);
-      return GameSettings[level];
-    },
+    setLevel: (level) => {},
   };
 };
killedBy: useGame test cases Render behaviour onChange game level handler
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))
