[Killed] BooleanLiteral
src/modules/GameWithHooks/useStatus.ts:23:48
 export const useStatus = (): ReturnType => {
   const { NewGame, InProgress, Win, Loose } = GameStatuses;
 
-  const [isGameOver, setIsGameOver] = useState(false);
+  const [isGameOver, setIsGameOver] = useState(true);
   const [isWin, setIsWin] = useState(false);
   const [isGameStarted, setIsGameStarted] = useState(false);
killedBy: useGame test cases Render behaviour Render hook by default
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "isGameOver": false,

[Killed] BooleanLiteral
src/modules/GameWithHooks/useStatus.ts:24:38
   const { NewGame, InProgress, Win, Loose } = GameStatuses;
 
   const [isGameOver, setIsGameOver] = useState(false);
-  const [isWin, setIsWin] = useState(false);
+  const [isWin, setIsWin] = useState(true);
   const [isGameStarted, setIsGameStarted] = useState(false);
 
killedBy: useGame test cases Render behaviour Render hook by default
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Object {
    "isGameOver": false,

[Killed] BooleanLiteral
src/modules/GameWithHooks/useStatus.ts:25:54
 
   const [isGameOver, setIsGameOver] = useState(false);
   const [isWin, setIsWin] = useState(false);
-  const [isGameStarted, setIsGameStarted] = useState(false);
+  const [isGameStarted, setIsGameStarted] = useState(true);
 
   const setGameStatus = (status: GameStatuses) => {
killedBy: useGame test cases Scoreboard behavior - timer and bomb counter Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] BlockStatement
src/modules/GameWithHooks/useStatus.ts:27:51
   const [isWin, setIsWin] = useState(false);
   const [isGameStarted, setIsGameStarted] = useState(false);
 
-  const setGameStatus = (status: GameStatuses) => {
-    setIsGameStarted(status === InProgress);
-    setIsWin(status === Win);
-    setIsGameOver([Win, Loose].includes(status));
-  };
+  const setGameStatus = (status: GameStatuses) => {};
 
   const setNewGame = () => {
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/modules/GameWithHooks/useStatus.ts:28:22
   const [isGameStarted, setIsGameStarted] = useState(false);
 
   const setGameStatus = (status: GameStatuses) => {
-    setIsGameStarted(status === InProgress);
+    setIsGameStarted(true);
     setIsWin(status === Win);
     setIsGameOver([Win, Loose].includes(status));
killedBy: useGame test cases OnClick with OnChangeGameLevel onReset game handler
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/modules/GameWithHooks/useStatus.ts:28:22
   const [isGameStarted, setIsGameStarted] = useState(false);
 
   const setGameStatus = (status: GameStatuses) => {
-    setIsGameStarted(status === InProgress);
+    setIsGameStarted(status !== InProgress);
     setIsWin(status === Win);
     setIsGameOver([Win, Loose].includes(status));
killedBy: useGame test cases OnClick with OnChangeGameLevel onReset game handler
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/modules/GameWithHooks/useStatus.ts:29:14
 
   const setGameStatus = (status: GameStatuses) => {
     setIsGameStarted(status === InProgress);
-    setIsWin(status === Win);
+    setIsWin(status !== Win);
     setIsGameOver([Win, Loose].includes(status));
   };
killedBy: useGame test cases OnClick with OnChangeGameLevel onReset game handler
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/modules/GameWithHooks/useStatus.ts:29:14
 
   const setGameStatus = (status: GameStatuses) => {
     setIsGameStarted(status === InProgress);
-    setIsWin(status === Win);
+    setIsWin(false);
     setIsGameOver([Win, Loose].includes(status));
   };
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/modules/GameWithHooks/useStatus.ts:33:28
     setIsGameOver([Win, Loose].includes(status));
   };
 
-  const setNewGame = () => {
-    setGameStatus(NewGame);
-  };
+  const setNewGame = () => {};
 
   const setInProgress = () => {
killedBy: useGame test cases OnClick with OnChangeGameLevel onReset game handler
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/modules/GameWithHooks/useStatus.ts:37:31
     setGameStatus(NewGame);
   };
 
-  const setInProgress = () => {
-    setGameStatus(InProgress);
-  };
+  const setInProgress = () => {};
 
   const setGameWin = () => {
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useStatus.ts:41:28
     setGameStatus(InProgress);
   };
 
-  const setGameWin = () => {
-    setGameStatus(Win);
-  };
+  const setGameWin = () => {};
 
   const setGameLoose = () => {
killedBy: useGame test cases Game over behavior Player win a game when open the last cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/modules/GameWithHooks/useStatus.ts:45:30
     setGameStatus(Win);
   };
 
-  const setGameLoose = () => {
-    setGameStatus(Loose);
-  };
+  const setGameLoose = () => {};
 
   return {
killedBy: useGame test cases Game over behavior Player loose the game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] ObjectLiteral
src/modules/GameWithHooks/useStatus.ts:49:10
     setGameStatus(Loose);
   };
 
-  return {
-    isGameStarted,
-    isWin,
-    isGameOver,
-    setNewGame,
-    setInProgress,
-    setGameWin,
-    setGameLoose,
-  };
+  return {};
 };
 
killedBy: useGame test cases Render behaviour Render hook by default
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,8 +1,8 @@
  Object {
-   "isGameOver": false,
