[NoCoverage] ArrowFunction
Apps/minesweeper/src/index.tsx:18:16
       levels={["beginner", "intermediate", "expert"]}
       defaultLevel="intermediate"
       bombs="010"
-      onReset={() => null}
+      onReset={() => undefined}
       onChangeLevel={() => null}
     />
