[Killed] BlockStatement
src/components/Grid/Cell.tsx:33:15
 export const areEqual = (
   prevProps: CellProps,
   nextProps: CellProps
-): boolean => {
-  const areEqualCoords =
-    prevProps.coords.filter(
-      (coord: number, idx: number) => nextProps.coords[idx] !== coord
-    ).length === 0;
-
-  return (
-    prevProps.children === nextProps.children &&
-    areEqualCoords &&
-    prevProps.onClick === nextProps.onClick &&
-    prevProps.onContextMenu === nextProps.onContextMenu
-  );
-};
+): boolean => {};
 
 export const Cell: FC<CellProps> = ({ children, coords, ...rest }) => {
killedBy: Cell component check Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/components/Grid/Cell.tsx:35:5
   nextProps: CellProps
 ): boolean => {
   const areEqualCoords =
-    prevProps.coords.filter(
-      (coord: number, idx: number) => nextProps.coords[idx] !== coord
-    ).length === 0;
+    prevProps.coords.filter((coord: number, idx: number) => nextProps.coords[idx] !== coord).length !== 0;
 
   return (
killedBy: Cell component check Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/components/Grid/Cell.tsx:35:5
   nextProps: CellProps
 ): boolean => {
   const areEqualCoords =
-    prevProps.coords.filter(
-      (coord: number, idx: number) => nextProps.coords[idx] !== coord
-    ).length === 0;
+    prevProps.coords.length === 0;
 
   return (
killedBy: Cell component check Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:36:7
 ): boolean => {
   const areEqualCoords =
     prevProps.coords.filter(
-      (coord: number, idx: number) => nextProps.coords[idx] !== coord
+      () => undefined
     ).length === 0;
 
killedBy: Cell component check Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:36:39
 ): boolean => {
   const areEqualCoords =
     prevProps.coords.filter(
-      (coord: number, idx: number) => nextProps.coords[idx] !== coord
+      (coord: number, idx: number) => false
     ).length === 0;
 
killedBy: Cell component check Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/components/Grid/Cell.tsx:40:5
     ).length === 0;
 
   return (
-    prevProps.children === nextProps.children &&
-    areEqualCoords &&
+    prevProps.children === nextProps.children || areEqualCoords &&
     prevProps.onClick === nextProps.onClick &&
     prevProps.onContextMenu === nextProps.onContextMenu
killedBy: Cell component check Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
src/components/Grid/Cell.tsx:70:20
     onMouseUp,
     onMouseLeave: onMouseUp,
     mouseDown,
-    "data-testid": `${coords}`,
+    "data-testid": ``,
     role: "cell",
   };
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] StringLiteral
src/components/Grid/Cell.tsx:117:51
     case CellState.weakFlag:
       return (
         <ClosedFrame {...rest}>
-          <WeakFlag data-testid={`weakFlag_${rest["data-testid"]}`} />
+          <WeakFlag data-testid={`weakFlag_${rest[""]}`} />
         </ClosedFrame>
       );
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 13`

- Snapshot  - 1
+ Received  + 1

@@ -4,9 +4,9 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:129:56
   mouseDown?: boolean;
 }
 
-export const ClosedFrame = styled.div<ClosedFrameProps>`
-  display: flex;
-  align-items: center;
-  justify-content: center;
-  user-select: none;
-  cursor: pointer;
-  width: 1.8vh;
-  height: 1.8vh;
-  color: transparent;
-  background-color: #d1d1d1;
-  border: 0.6vh solid transparent;
-  border-color: ${({ mouseDown = false }) =>
-    mouseDown ? "transparent" : "white #9e9e9e #9e9e9e white"};
-  &:hover {
-    filter: brightness(1.1);
-  }
-`;
+export const ClosedFrame = styled.div<ClosedFrameProps>``;
 
 const transparent = "rgba(0,0,0,0)";
killedBy: Cell component check Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correct 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:141:17
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
   border-color: ${({ mouseDown = false }) =>
-    mouseDown ? "transparent" : "white #9e9e9e #9e9e9e white"};
+    mouseDown ? "" : "white #9e9e9e #9e9e9e white"};
   &:hover {
     filter: brightness(1.1);
killedBy: Cell component check Closed Frame renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Closed Frame renders correct 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>
