[Killed] ArrowFunction
src/components/Scoreboard/Level.tsx:19:38
   onChange: (event: ChangeEvent<HTMLSelectElement>) => void;
 }
 
-export const Level: FC<LevelProps> = ({ children, value, onChange }) => (
-  <Select onChange={onChange} value={value}>
-    {children.map((item: string) => (
-      <Option key={item} value={item}>
-        {item}
-      </Option>
-    ))}
-  </Select>
-);
+export const Level: FC<LevelProps> = () => undefined;
 
 // Stryker disable next-line StringLiteral
killedBy: Scoreboard test cases Scoreboard renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Scoreboard test cases Scoreboard renders correctly 1`

- Snapshot  - 22
+ Received  +  0

@@ -6,32 +6,10 @@
