[Killed] BlockStatement
src/components/Scoreboard/Reset.tsx:12:55
   onReset: () => void;
 }
 
-export const Reset: FC<ResetProps> = ({ onReset }) => {
-  const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
-
-  return (
-    <Button
-      onMouseDown={onMouseDown}
-      onMouseLeave={onMouseUp}
-      onMouseUp={onMouseUp}
-      onClick={onReset}
-    >
-      {mouseDown ? "😯" : "🙂"}
-    </Button>
-  );
-};
+export const Reset: FC<ResetProps> = ({ onReset }) => {};
 
 // Stryker disable next-line StringLiteral
killedBy: Scoreboard test cases Scoreboard renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Scoreboard test cases Scoreboard renders correctly 1`

- Snapshot  - 5
+ Received  + 0

@@ -28,15 +28,10 @@
