[Killed] ArrayDeclaration
minesweeper/src/helpers/Field.ts:31:13
 export const generateFieldWithDefaultState = (
   size: number,
   state: Cell = CellState.empty
-): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
+): Field => new Array().fill(null).map(() => new Array(size).fill(state));
 
 /**
killedBy: Field Generator emptyFieldGenerator tests 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Array [
-     0,

[Killed] BlockStatement
minesweeper/src/helpers/Field.ts:66:66
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
       // Stryker disable next-line EqualityOperator
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeighbours([y, x], result);
-        restCellsWithBombs--;
-      }
+      if (restCellsWithBombs / unprocessedCells > Math.random()) {}
       unprocessedCells--;
     }
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] ArrayDeclaration
minesweeper/src/helpers/Field.ts:68:29
       // Stryker disable next-line EqualityOperator
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
         result[y][x] = CellState.bomb;
-        incrementNeighbours([y, x], result);
+        incrementNeighbours([], result);
         restCellsWithBombs--;
       }
killedBy: Field Generator Simple cases 2x2 field with 50% probability
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []
