[Killed] LogicalOperator
minesweeper/src/helpers/CellsManipulation.ts:29:3
  * @returns {boolean}
  */
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  y >= 0 && x >= 0 && length - y > 0 || length - x > 0;
 
 /**
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
minesweeper/src/helpers/CellsManipulation.ts:37:77
  * @param {Field} field
  * @returns {Cell}
  */
-export const incrementNeighbours = (coords: Coords, field: Field): Field => {
-  const items = getNeigboursItems(coords);
-
-  for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
-      const cell = field[y][x];
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
-  }
-
-  return field;
-};
+export const incrementNeighbours = (coords: Coords, field: Field): Field => {};
 
killedBy: Check Increment Neibours Simple cases Field with only one item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[9]]
Received: undefined
