[Killed] ArrowFunction
src/components/Top/Legend.tsx:19:40
   secondAction: string;
 }
 
-export const Legend: FC<LegendProps> = ({
-  feature,
-  firstAction,
-  secondAction,
-}) => (
-  <Parent>
-    <strong>{feature}: </strong>
-    <FlagComboParent>
-      <Key>{firstAction} </Key> + <Click>{secondAction}</Click>
-    </FlagComboParent>
-  </Parent>
-);
+export const Legend: FC<LegendProps> = () => undefined;
 
 const Key = styled.span`
killedBy: Top renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Top renders correctly 1`

- Snapshot  - 22
+ Received  +  0

@@ -5,29 +5,7 @@
